# panda:
- like excel 
- build on numpy
- data manupilattion
- Visalize 
- data sources 
- 2008 
- data analysis

In [1]:
import pandas as pd

In [2]:
pd.__version__

'1.4.2'

# Panda-- 1D: series, 2D: dataframe

In [3]:
# series 
list = [1,2,3,99]
s = pd.Series(data =list)
s

0     1
1     2
2     3
3    99
dtype: int64

In [4]:
s[3]

99

In [5]:
a = pd.Series(data=list,index=['A','B','C','D'])
a

A     1
B     2
C     3
D    99
dtype: int64

In [6]:
a[0]

1

In [7]:
a['A']

1

In [8]:
# series ---> dict
d = {'A':10,'B':20,'C':30}
f = pd.Series(d)
f

A    10
B    20
C    30
dtype: int64

-----

# Dataframe:
- Main tool in pandas
- 2d data structure, column , rows 
- column = series = data type

In [ ]:
data_1 = {
    'Students' : ['Mahmoud','Ahmed','Ail'],
    'Marks' : [50,60,70],
    'age' : [22,23,24,21]
}

df4 = pd.DataFrame(data_1)
df4

In [49]:
data_1

{'Students': ['Mahmoud', 'Ahmed', 'Ail'],
 'Marks': [50, 60, 70],
 'age': [22, 23, 24, 21]}

In [ ]:
df2 = pd.DataFrame(data,index=['A','B','C'])
df2

In [11]:
# get data from dataframe 

df['Students']

0    Mahmoud
1      Ahmed
2        Ail
Name: Students, dtype: object

In [12]:
df.Students

0    Mahmoud
1      Ahmed
2        Ail
Name: Students, dtype: object

-------

In [13]:
data1 = {
    'Students' : ['Mahmoud','Ahmed','Ail'],
    'Marks' : [50,60,70],
    'Year' : [2015,2016,2017],
    'Age': [21,22,23]
}

df2 = pd.DataFrame(data)
df2

  Students  Marks
0  Mahmoud     50
1    Ahmed     60
2      Ail     70

In [17]:
df2.Students

0    Mahmoud
1      Ahmed
2        Ail
Name: Students, dtype: object

In [18]:
df2['Students']

0    Mahmoud
1      Ahmed
2        Ail
Name: Students, dtype: object

--------

-------------------------

In [ ]:
df2['new_column'] =  df2['Marks'] + df2['Year']
df2

-------------

In [22]:
# data 


df2.drop('Marks',axis=1)

  Students
0  Mahmoud
1    Ahmed
2      Ail

In [23]:
df2 # not deleted so we need to use inplace into true

  Students  Marks
0  Mahmoud     50
1    Ahmed     60
2      Ail     70

In [24]:
df2.drop('Marks',axis=1,inplace = True) # drop column

In [25]:
df2

  Students
0  Mahmoud
1    Ahmed
2      Ail

In [26]:
# drop raw 

df2.drop(2)

  Students
0  Mahmoud
1    Ahmed

In [27]:
df.shape

(3, 2)

In [28]:
# locate elements 
df

  Students  Marks
0  Mahmoud     50
1    Ahmed     60
2      Ail     70

In [29]:
df.loc[2] # name of place (value)

Students    Ail
Marks        70
Name: 2, dtype: object

In [30]:
df.loc[2,'Marks']

70

In [31]:
 df.iloc[:,1] # iloc, index

0    50
1    60
2    70
Name: Marks, dtype: int64

--------------

In [32]:
df2

  Students
0  Mahmoud
1    Ahmed
2      Ail

In [ ]:
df2.loc[df2.Age>21] # with condation

In [ ]:
df2.loc[df2.Age==22] # with condation

-----------------

In [ ]:
df2.loc[df2['Students'].isin(['Ail','Ahmed']),:]

In [ ]:
df2.loc[(df2.Age>22)&(df2.Year>2016)] # with && condation

In [ ]:
# apply lamda on column

df['Students'].apply(lambda x:x.upper())

----------------------

In [34]:
# mask 
df2

  Students
0  Mahmoud
1    Ahmed
2      Ail

In [39]:
df

  Students  Marks
0  Mahmoud     50
1    Ahmed     60
2      Ail     70

In [ ]:
df[df['A']]